year = int(input("Введите год рождения "))
year *= 4
year = str(year)  # преобразование в строку
s = 0
for i in year:  # перебор символов в строке
    i = int(i)  # символ стал числом
    s += i  # сумма чисел
print(
    "Раз, два... Меркурий в четвертом доме... луна ушла... "
    "шесть – несчастье... вечер – семь..."
)
if s % 2 == 0:  # четность
    print("Вас ждет уважение.")
if s % 8 == 0:  # делимость на 8
    print("Вы будете богат")
if len(str(s)) == 2:  # длина строки=2. т.е. число двузначное
    print("Вы проживете долгую жизнь")
if s % 2 != 0 and s % 8 != 0 and len(str(s)) != 2:
    print("Я не могу предсказать Вашу судьбу!")
